
# 进制转化，将十进制转化为2,8,16进制
# 采用的方式为，除去所要转化的进制，取余，商再次除以要转换的进制，依次循环，直至商为0

print('数制转换器，可将10进制的数转化成 2,8,16 进制的数')
i = int(input('请输入要转换的数字:\n'))
k = int(input('请输入要转换成的进制：\n'))

kk = {
    0 : '0',
    1 : '1',
    2 : '2',
    3 : '3',
    4 : '4',
    5 : '5',
    6 : '6',
    7 : '7',
    8 : '8',
    9 : '9',
    10 : 'A',
    11 : 'B',
    12 : 'C',
    13 : 'D',
    14 : 'E',
    15 : 'F'
}

jinzhi = {
    2 : 'bin',
    8 : 'oct',
    10 : 'dec',
    16 : 'hex'}
ii = i
s = ''
while i > 0:
    s = kk[i % k] + s
    i //= k
print('{} -> {} ({})'.format(ii,s,jinzhi.get(k)))